In [1]:
#  Data comes from: 
#  https://www.fcc.gov/general/broadband-deployment-data-fcc-form-477
#  https://www.fcc.gov/reports-research/reports/measuring-broadband-america/charts-measuring-broadband-america-2016

In [1]:
import pandas as pd
import numpy as np
import plotnine as p9

In [2]:
maryland = pd.read_csv("MD_advertised.csv")
download = pd.read_csv("MD_down_county.csv")
upload = pd.read_csv("MD_up_county.csv")

In [3]:
maryland.head()

                  DBAName  MaxAdDown  MaxAdUp
0  Global Telecom Brokers        0.0      0.0
1  Global Telecom Brokers        0.0      0.0
2  Global Telecom Brokers        0.0      0.0
3  Global Telecom Brokers        0.0      0.0
4  Global Telecom Brokers        0.0      0.0

In [6]:
advertised = maryland[['DBAName', 'MaxAdDown', 'MaxAdUp']].groupby(['DBAName']).agg(['mean'])

In [28]:
advertised.head()

                          MaxAdDown MaxAdUp
                               mean    mean
DBAName
24/7 Mid-Atlantic Network       0.0     0.0
ALTIUS Broadband               50.0    50.0
Access One, Inc.                0.0     0.0
All Points Broadband           15.0     4.0
Allied Telecom Group LLC        0.0     0.0

In [8]:
download.head()

,OBJECTID,C0_NAME,Cnt_C0_NAME,Min_Download,Max_Download,Ave_Download,SHAPEarea,SHAPElen
0,1,Allegany,383,0,225930,8696.577023,1.824785e+09,4.671261e+05
1,2,Anne Arundel,1904,0,208803,16184.321429,1.778026e+09,1.254422e+06
2,3,Baltimore,2610,0,262450,18535.531801,2.608355e+09,1.183828e+06
3,4,Baltimore City,1955,27,175997,11553.283887,3.513710e+08,2.510998e+05
4,5,Calvert,319,47,54814,12195.250784,9.087738e+08,4.525549e+05

In [9]:
upload.head()

,OBJECTID,C0_NAME,Cnt_C0_NAME,Min_Upload,Max_Upload,Ave_Upload,SHAPEarea,SHAPElen
0,1,Allegany,383,34,38015,2683.971279,1.824785e+09,4.671261e+05
1,2,Anne Arundel,1904,46,71204,5996.515756,1.778026e+09,1.254422e+06
2,3,Baltimore,2610,49,216038,5613.704981,2.608355e+09,1.183828e+06
3,4,Baltimore City,1955,5,84693,3227.357545,3.513710e+08,2.510998e+05
4,5,Calvert,319,50,11656,2883.808777,9.087738e+08,4.525549e+05

In [19]:
county_data= pd.merge(download, upload[['Min_Upload', 'Max_Upload', 'Ave_Upload', 'C0_NAME']], on='C0_NAME')

In [20]:
county_data.head()

,OBJECTID,C0_NAME,Cnt_C0_NAME,Min_Download,Max_Download,Ave_Download,SHAPEarea,SHAPElen,Min_Upload,Max_Upload,Ave_Upload
0,1,Allegany,383,0,225930,8696.577023,1.824785e+09,4.671261e+05,34,38015,2683.971279
1,2,Anne Arundel,1904,0,208803,16184.321429,1.778026e+09,1.254422e+06,46,71204,5996.515756
2,3,Baltimore,2610,0,262450,18535.531801,2.608355e+09,1.183828e+06,49,216038,5613.704981
3,4,Baltimore City,1955,27,175997,11553.283887,3.513710e+08,2.510998e+05,5,84693,3227.357545
4,5,Calvert,319,47,54814,12195.250784,9.087738e+08,4.525549e+05,50,11656,2883.808777

In [23]:
county_data.drop(['SHAPEarea','SHAPElen'], axis=1)

,OBJECTID,C0_NAME,Cnt_C0_NAME,Min_Download,Max_Download,Ave_Download,Min_Upload,Max_Upload,Ave_Upload
0,1,Allegany,383,0,225930,8696.577023,34,38015,2683.971279
1,2,Anne Arundel,1904,0,208803,16184.321429,46,71204,5996.515756
2,3,Baltimore,2610,0,262450,18535.531801,49,216038,5613.704981
3,4,Baltimore City,1955,27,175997,11553.283887,5,84693,3227.357545
4,5,Calvert,319,47,54814,12195.250784,50,11656,2883.808777
5,6,Caroline,141,0,61143,6603.574468,30,14328,1556.957447
6,7,Carroll,637,0,77593,9562.478807,15,62932,2677.238619
7,8,Cecil,247,40,85826,7612.412955,9,83685,2374.202429
8,9,Charles,929,0,160807,7623.145318,14,37232,2107.238967
9,10,Dorchester,185,23,38422,6961.681081,5,13479,2485.572973
10,11,Frederick,759,0,120744,12138.445323,20,29140,3468.940711
11,12,Garrett,182,12,37945,4635.159341,38,19100,1694.236264
12,13,Harford,766,38,78210,12672.762402,18,26641,4030.244125
13,14,Howard,1419,33,209861,16540.265680,38,54782,5899.780127
14,15,Kent,142,0,51360,5981.387324,26,36675,2208.669014
15,16,Montgomery,3967,0,167328,15279.234686,4,85400,5456.099824
16,17,Prince George's,1410,10,238631,14313.640426,8,135334,5787.687234
17,18,Queen Anne's,205,215,65688,5429.278049,31,36130,1226.580488
18,19,Somerset,179,0,44419,4634.759777,50,16513,1274.407821
19,20,St. Mary's,772,22,68837,6415.830311,22,23209,943.321244
20,21,Talbot,273,21,35443,4489.622711,3,8691,803.443223
21,22,Washington,456,54,722558,14516.741228,71,42542,2322.627193
22,23,Wicomico,800,16,109475,15077.152500,34,36432,4224.990000
23,24,Worcester,315,19,46292,8564.266667,17,50659,2529.311111

In [34]:
county_data['Ave_Download'].mean()

10259.033498990413

In [35]:
county_data['Ave_Upload'].mean()

3061.5377979925

In [29]:
advertised['MaxAdDown'].mean()

mean    56.616182
dtype: float64

In [33]:
advertised['MaxAdUp'].mean()

mean    30.192018
dtype: float64